app/Controllers/Registrasi.php

    public function save()
    {
        $this->accountModel->save([
            'username' => $this->request->getVar('username'),
            'nama' => $this->request->getVar('nama'),
            'password' => $this->request->getVar('password')
        ]);
---
INSERT INTO `account` (`username`, `nama`, `password`, `created_at`, `updated_at`) VALUES ('1221122112211221', 'asde', 'dsadsa', '2022-06-28 11:17:37', '2022-06-28 11:17:37')